import { meditationBanner } from "../../assets/images";
import { PanoramicBanner } from "../../components";

const MeditationPractices = () => {
  const resourceData = {
    title: "Meditation Practices",
    banner: meditationBanner,
    description: "Techniques to calm the mind and cultivate inner peace.",
    paragraphs: [
      "தியானம் என்பது நம் வாழ்க்கைக்கு மிகவும் தேவையான ஒன்று அதனை மேற்கொள்ளும் போதுதான் அனைவரும் நிதானமாக வாழ முடியும். உங்கள் வாழ்வில் நீங்கள் எப்போதெல்லாம் தவறு செய்து இருக்கிறீர்களோ, அப்போதெல்லாம் நீங்கள் நிதானம் தவறி இருப்பீர்கள். வாழ்க்கையில் சிறந்த முடிவுகளை பதட்டமில்லாமல் திடமாகவும் நிதானமாகவும் எடுக்க தியானம் செய்வது மிகவும் அவசியம். தியானம் என்பது மிகப்பெரிய பயிற்சி. அதை தினமும் செய்ய செய்ய தான் அதன் பலன் முழுவதுமாக கிடைக்கும். மேலும், நம் உடலில் நேர்மறை ஆற்றல்களை தேக்கி வைத்து கொண்டே வரும். நீங்கள் தொடர்ந்து 12 ஆண்டுகளுக்கு தினசரி தியான பயிற்சிகளை மேற்கொண்டு வந்தால் உங்கள் முடிவுகளை உணர்ச்சி வசப்படாமல் திடமாக எடுக்க முடியும்.",
      "ஜெய் கோஷா அறக்கட்டளையில் பயிற்றுவிக்கப்படும் தியான பயிற்சி வகுப்புகளில் தூர தேச பயணம் என்னும் பெயரில் தியான பயிற்சி அளிக்கப்படுகிறது. இந்த வகுப்பில் பங்கேற்கும் அனைவரும் தங்கள் மனங்களை ஒருநிலைப்படுத்தி தியானங்களை மேற்கொள்வார்கள். அந்த சமயத்தில் அனைவரும் கண்களை மூடி அமர்ந்திருப்பார்கள். அந்த நேரத்தில் ஒவ்வொருவரும் எதை பற்றி வேண்டுமானாலும் நினைத்திருக்கலாம். ஆனால், வகுப்பின் முடிவில் ஒவ்வொருவரிடமும் தனித்தனியே தியானத்தின் போது அவர்கள் மனம் கண்ட காட்சிகளையும் சென்ற இடங்களையும் பற்றி கேள்வி எழுப்பினால் அவர்கள் அனைவரும் ஒரே பதிலையே தருவார்கள். இதுவே இந்த பயிற்சியின் சிறப்பாகும்.",
      "அகஸ்தியர், போகர் போன்ற சித்தப் பெருமார்கள் அனைவரும் இதுபோன்ற தியானங்களை மேற்கொண்டே பிரபஞ்சத்தில் உள்ள பூமி ஒன்பது கோள்கள் மற்றும் ஈரேழு பதினான்கு உலகங்களையும் கண்டு கொண்டார்கள். இந்த தியான முறைக்கு தியான பொத்தகம் என்று பெயர். இந்த முறையை கற்றறிந்த குருமார்கள் அனைவரும் இதனை ஒரே மாதிரியே கற்று கொடுப்பார்கள். தற்போது கண்களை மூடி அமர்ந்து அவரவர் மனம் போன போக்கில் சென்று எழுந்தாலே அது தியானம் என்கிறார்கள். ஆனால், முற்காலத்தில் அடிப்படை தியான பொத்தக பயிற்சியை அறிந்தவர்களுக்கே மேற்கொண்டு தியான பயற்சி முறைகளை அன்றைய குருமார்கள் கற்றுக்கொடுத்தார்கள். கணிதத்தில் வரும் சூத்திரங்களை போல தியான பொத்தக முறைகளும் அந்த பயிற்சியின் சூத்திரம் ஆகும். இந்த பயிற்சிகளை வெவ்வேறு குருமார்களிடம் கற்றிருந்தாலும் முறையாக பயிற்சி எடுக்காவிட்டால் அதன் முழு பலனை அடைய முடியாது. அந்த பயிற்சி முறைகளே நமது ஜெய் கோஷா அறக்கட்டளையில் நடைபெறும் தியான பயிற்சி வகுப்புகளில் கற்று கொடுக்கப்படுகிறது.",
    ],
  };
  return (
    <main>
      <PanoramicBanner
        bgImg={resourceData?.banner}
        title={resourceData?.title}
      />
      <section className="bg-yellow-50 py-12">
        <div className="container">
          <h2 className="text-2xl font-bold text-emerald-600 px-4 mb-4">
            {resourceData?.title}
          </h2>
          <div className="px-4 text-md text-justify font-semibold indent-10 leading-normal text-red-500">
            {resourceData?.paragraphs.map((para, index) => (
              <p key={index} className="mb-5">
                {para}
              </p>
            ))}
          </div>
        </div>
      </section>
    </main>
  );
};

export default MeditationPractices;
