import { spiritualDevicesBanner } from "../../assets/images";
import { PanoramicBanner } from "../../components";

const SpritualDevices = () => {
  const resourceData = {
    title: "Spiritual Devices",
    banner: spiritualDevicesBanner,
    description: "Transform your spirit with our unique spiritual devices.",
    paragraphs: [
      "ஆன்மீகத்தைக் கடைபிடிக்கும் ஒவ்வொருவரும் சதா சர்வமும் அவர்களுடைய கவனம் முழுவதும் ஆன்மீகத்தில் இருக்க வேண்டும் என்பதை நினைவூட்ட ஒரு அடையாள ஒரு சில அடையாள பொருட்கள் தேவைப் படுகின்றன அதில் பெரும்பாலானோர் பல்வேறு விதமான மாலைகளை அணிகிறார்கள்  அந்த மாலை எப்பொழுதும் அவர்களின் இதயத்தின் அருகே இருப்பதால் அவர்களுக்கு உறுத்தும் அது அவர்களுக்கு ஒரு கவசமாக இருந்து பாதுகாக்கும் எனவே சபரி மலை போன்ற யாத்திரைகள் போதும் ஜெபம் மற்றும் தியானம் மேற்கொள்ளும் போதும் அவர்கள் மாலை அணிந்து கொள்ள வேண்டுமென்பது ஐதீகம் ஆன்மீகத்தை கடைபிடிக்கும் எந்த ஒரு மனிதரும் நிராயுதபாணியாக இருக்க கூடாது ஒரேயொரு மணியாவது அணிய வேண்டும் அந்த மணியும் கூட 27 நட்சத்திர காரர்களுக்கும் மாறுபடக்கூடியது பெரும்பாலான மனிதர்கள் தேர்ந்தெடுப்பது ருத்திராட்ச மாலையாகும் ஆனால் முகங்களின் அடிப்படையில் ருட்ராட்சதில் பல்வேறு வகைகள் உள்ளன எனவே  சிலபேருக்கு அது பொருந்தாது சரியான மாலையை அணிவதன் மூலம் ஆன்மீகத்தில் நம் இலக்குகளை விரைவில் அடையலாம்",
      "அதன்பிறகு ஆன்மீக குருமார்களிடம் இருந்து தனக்கென ஒரு பிரத்யேக மந்திரத்தை கற்றுக்கொள்ள வேண்டும் அதன்பிறகு ஒவ்வொருவரும் அவர்களின் பிறப்பு அம்சங்கள் மற்றும் இஷ்ட தேவதைகளின் துணைக்கு தேவையான அவரவர்க்கென்று வடிவமைக்கப்பட்ட ஒரு எந்திரத்தை குருமார்களிடம் பெற்றுக்கொள்ள வேண்டும் அதனை அனுதினமும் அவர்கள் வழிபட வேண்டும் . அந்த எந்திரங்கள் இங்கே வடிவமைத்து கொடுக்கப்படும் அந்த எந்திரங்களை வழிபடும் தந்திரங்களை ஆன்மீக குருமார்களிடம் இருந்து கற்றுக்கொள்ள வேண்டும் எனவே மணி (மாலை), மந்திரம், எந்திரம் மற்றும் தந்திரம் இவை நான்கையும் யார் ஆன்மீகத்தில் மிகச் சரியாக கடைபிடிக்கிறார்களோ அவர்களுக்கு அவ்சதம் (அதாவது மருத்துவம்) என்பதே தேவையில்லை ஏனென்றால் அவர்களின் மனம் எப்போதும் மகிழ்ச்சியாக இருக்கும் அதுவே நிரந்தர சஞ்சீவி ",
      "சாதாரண மனிதர்கள் தினமும் எழுந்து குளித்து உணவருந்தி அவர்களின் உடலை பேணி காப்பதுபோல ஆன்மீகத்தை கடைப்பிடிப்பவர்கள் அவர்களின் மனதை தயார் படுத்திக்கொள்ள தேவையான பயிற்சிகளும் அதற்கு தேவையான ஆன்மீக பொருட்களும்  நமது ஜெய் கோஷா அறக்கட்டளையில் வழங்கப்படுகிறது. அந்த பொருட்களே அவரவர்க்கு ஏற்ற இஷ்ட தெய்வமாகவும் குலதெய்வமாகவும் இருந்து அவர்களை காக்கும் . அவர்களின் வேண்டுதல்களை எல்லாம் அதன் மேல் வைக்கும் போது 1000 பேர் உடன் இருப்பது போன்ற வலிமை கிடைக்கும் இதுபோன்ற ஆன்மீக பொருள்களை ஜெய் கோஷாவில் அவரவர்களுக்கு ஏற்றார் போல வடிவமைத்துக் கொடுக்கிறோம் ",
    ],
  };
  return (
    <main>
      <PanoramicBanner
        bgImg={resourceData?.banner}
        title={resourceData?.title}
      />
      <section className="bg-yellow-50 py-12">
        <div className="container">
          <h2 className="text-2xl font-bold text-emerald-600 px-4 mb-4">
            {resourceData?.title}
          </h2>
          <div className="px-4 text-md text-justify font-semibold indent-10 leading-normal text-red-500">
            {resourceData?.paragraphs.map((para, index) => (
              <p key={index} className="mb-5">
                {para}
              </p>
            ))}
          </div>
        </div>
      </section>
    </main>
  );
};

export default SpritualDevices;
